In [2]:
import pandas as pd
from datetime import datetime
import re

In [3]:
cust = pd.read_csv("customers.csv", delimiter=';')
prod = pd.read_csv("products.csv", delimiter=';')
trans = pd.read_csv("transactions.csv", delimiter=';')

In [4]:
cust.head(10)

   customer_id first_name last_name                      email
0            1      James  Martinez      david.brown@email.com
1            2       Jane       Lee      anna.miller@email.com
2            3     Sophie     Smith     sophie.brown@email.com
3            4     Robert       Lee  robert.williams@email.com
4            5      David     Smith      john.miller@email.com
5            6       Jane     Smith         jane.lee@email.com
6            7       Lisa     Smith        david.doe@email.com
7            8       Lisa   Johnson     robert.smith@email.com
8            9       John     Brown   robert.johnson@email.com
9           10       John    Taylor     jane.johnson@email.com

In [5]:
prod.head(10)

   product_id product_name     category       price
0         101  Product 101  Electronics  182.474044
1         102  Product 102   Appliances  112.870046
2         103  Product 103  Electronics  453.002773
3         104  Product 104  Electronics  225.062933
4         105  Product 105   Appliances  285.062664
5         106  Product 106   Appliances  485.428209
6         107  Product 107  Electronics  205.695362
7         108  Product 108     Clothing  388.884465
8         109  Product 109   Appliances  224.001381
9         110  Product 110  Electronics  427.471787

In [6]:
trans.head(10)

   transaction_id transaction_date  product_id      amount
0               1       2024-07-06         103  100.045934
1               2       2024-09-08         106  317.079944
2               3       2024-07-31         105  309.191028
3               4       2024-04-10         103  424.357274
4               5       2024-07-09         101  138.145672
5               6       2024-04-25         103  414.536235
6               7              NaN         104  328.273000
7               8       2024-08-30         106  344.829897
8               9       2024-10-03         106  126.410021
9              10       2024-04-06         106  404.427439

## Products

In [8]:
prod.isnull().sum()

product_id      0
product_name    0
category        0
price           0
dtype: int64

In [9]:
prod.duplicated().sum()

0

In [10]:
prod.dtypes

product_id        int64
product_name     object
category         object
price           float64
dtype: object

In [11]:
prod["category"] = prod["category"].astype("category")

Let's see if there are any weird values in Category column:

In [12]:
prod["category"].value_counts()

category
Furniture      218
Electronics    215
Toys           196
Clothing       192
Appliances     179
Name: count, dtype: int64

I will check whether any products have zero prices. These cases might indicate data entry issues, incomplete records, or products that were mistakenly added without a valid price.

In [14]:
prod[prod["price"] == 0]

Empty DataFrame
Columns: [product_id, product_name, category, price]
Index: []

In [95]:
prod.describe()

        product_id        price
count  1000.000000  1000.000000
mean    600.500000   272.437039
std     288.819436   127.321858
min     101.000000    50.268009
25%     350.750000   160.971608
50%     600.500000   270.075291
75%     850.250000   380.025934
max    1100.000000   499.943217

## Customers

In [17]:
cust.isnull().sum()

customer_id    0
first_name     0
last_name      0
email          0
dtype: int64

In [18]:
cust.duplicated().sum()

0

In [19]:
cust.dtypes

customer_id     int64
first_name     object
last_name      object
email          object
dtype: object

I checked the email addresses in the customers dataset to ensure they follow a valid format (e.g., name@example.com). A regular expression (regex) was used to validate the structure of each email.

In [21]:
pattern = r'^[\w\.-]+@[\w\.-]+\.\w{2,4}$'
is_valid = cust["email"].str.match(pattern)
invalid_emails = cust.loc[is_valid == False]

invalid_emails

Empty DataFrame
Columns: [customer_id, first_name, last_name, email]
Index: []

In [100]:
cust.describe()

       customer_id
count  1000.000000
mean    500.500000
std     288.819436
min       1.000000
25%     250.750000
50%     500.500000
75%     750.250000
max    1000.000000

## Transactions

In [23]:
trans.isnull().sum()

transaction_id      0
transaction_date    1
product_id          0
amount              0
dtype: int64

This one missing transaction_date is already a data quality issue. 

I cam't drop the row as it can affect aggregates.
As about mean/median values, although it's mathematically computable, it will be meaningless to do with dates. 
As about mode, it's also unreliable here as it's like saying "we’re not sure when this transaction happened, so let’s pretend it happened on the most popular date in the dataset", which is a wrong approach cuz there might not be a clear winner. Or the "most common" date might just show up twice just by coincidence so it would be random and misleading.

I'll check may I impute a date here or not, as if the csv is sorted by time I can look at several values before and after that one to check if it's the same day.

In [26]:
missing_id = trans[trans['transaction_date'].isnull()].index[0]

before_date = trans.loc[missing_id - 5, 'transaction_date']
after_date  = trans.loc[missing_id + 5, 'transaction_date']

before_date, after_date

('2024-09-08', '2024-03-01')

Since the values before and after the missing row are quite far apart, I can use imputation here as well.

In a real-world scenario, I would check the upstream pipeline, like the ETL process or data ingestion jobs or reach out to the data engineering team to trace and correct the missing date at the source. 

But since I only have access to static CSVs for this task, I will exclude the transaction with the missing transaction_date from any analysis since including it would lead to incorrect results.

Also, as it's connected with the other 2 tables, I'll consider that as well. 
I'll not delete related entries from the products or customers tables as the product or customer linked to the transaction might still be used in other valid transactions.

Instead, I’ll just move the problematic transaction into a separate dataset and mark it clearly. That way, it won’t interfere with any analysis, but it’s still there if someone wants to go back later and fix it, for example, by checking the original source system to find the correct date.

In [29]:
flag_miss = trans[trans["transaction_date"].isnull()]

In [30]:
flag_miss.to_csv("flagged_transactions.csv", index=False)

In [31]:
trans.duplicated().sum()

0

In [32]:
trans.dtypes

transaction_id        int64
transaction_date     object
product_id            int64
amount              float64
dtype: object

In [33]:
trans['transaction_date'] = pd.to_datetime(trans['transaction_date'])

In [34]:
trans.dtypes

transaction_id               int64
transaction_date    datetime64[ns]
product_id                   int64
amount                     float64
dtype: object

In [35]:
trans.head()

   transaction_id transaction_date  product_id      amount
0               1       2024-07-06         103  100.045934
1               2       2024-09-08         106  317.079944
2               3       2024-07-31         105  309.191028
3               4       2024-04-10         103  424.357274
4               5       2024-07-09         101  138.145672

I filtered the transactions dataset to identify any entries where the transaction_date is after today's date.

In [37]:
future_trans = trans[trans["transaction_date"] > datetime.now()]
future_trans

Empty DataFrame
Columns: [transaction_id, transaction_date, product_id, amount]
Index: []

Let's verify that all product_ids in the transactions table exist in the products table.
No customer_id exists in the transactions table, so no foreign key relationship can be checked with the customers data.

In [38]:
trans[trans["product_id"].isin(prod["product_id"]) == False]

Empty DataFrame
Columns: [transaction_id, transaction_date, product_id, amount]
Index: []

In [39]:
trans[trans["amount"] <= 0]

     transaction_id transaction_date  product_id      amount
73               74       2024-03-31         102 -424.064256
78               79       2024-02-22         103 -414.732789
95               96       2024-11-11         102 -182.364493
127             128       2024-10-27         102  -71.498899
134             135       2024-07-24         102 -468.879208
144             145       2024-11-11         103 -117.101448
159             160       2024-12-25         101  -72.631286
162             163       2024-03-11         104 -298.499619
166             167       2024-03-22         106 -350.989690
167             168       2024-09-02         103 -171.044906
185             186       2024-10-11         104 -372.546789
239             240       2024-12-16         103 -255.506883
242             243       2024-08-18         104 -448.075032
252             253       2024-04-24         106 -207.306458
283             284       2024-11-22         105  -78.727254
311             312       2024-11-15         103 -394.709340
316             317       2024-09-20         103 -433.551061
328             329       2024-12-20         106  -95.301534
335             336       2024-01-01         104 -113.891060
345             346       2024-04-03         103 -445.726265
393             394       2024-04-13         106 -448.397730
401             402       2024-11-24         105 -399.148860
420             421       2024-06-15         103 -162.771127
487             488       2024-08-19         106  -62.948463
492             493       2024-04-19         101 -282.661015
532             533       2024-03-26         102 -403.263463
538             539       2024-03-02         106 -434.330264
548             549       2024-07-27         105 -255.298771
622             623       2024-07-03         103 -407.803217
623             624       2024-11-29         105 -456.392905
637             638       2024-08-14         101 -459.371466
645             646       2024-03-23         101 -327.334923
653             654       2024-07-19         104 -391.919351
707             708       2024-02-29         105 -201.996607
715             716       2024-01-07         102 -130.338068
814             815       2024-10-14         105 -210.929111
822             823       2024-04-07         106 -147.239298
829             830       2024-06-20         102 -417.982781
834             835       2024-01-25         101 -163.678557
892             893       2024-08-03         105 -149.188731
917             918       2024-03-05         102 -411.491160
940             941       2024-04-20         102 -263.391381
990             991       2024-09-03         101 -150.913867
995             996       2024-02-26         102 -396.172085

I found 44 rows in the transactions data where the amount is negative. That might mean someone got a refund or maybe it’s just a mistake in the data - not 100% sure.

So instead of deleting those rows, I’ll just flag them for now and add to flagged_transactions dataset. This way, they stay in the dataset in case they’re actually valid, but it’s also clear that they might need a closer look later.

In [41]:
flag_neg = trans[trans["amount"] <= 0]

In [42]:
flag_neg.to_csv("flagged_transactions.csv", mode="a", index=False, header=False)

I've got an idea that as there is possibility that these values might represent refunds, I can verify if each negative transaction could be a valid refund by checking for a matching positive transaction of the same amount (and product) that occurred earlier.

To detect potential refunds, I compared each negative transaction with the rest of the data:
- It must have the same product_id
- The amounts should be equal in magnitude but opposite in sign
- The positive transaction should occur before the negative one

In [44]:
tolerance = 1e-2
refund_flags = []

for _, neg_row in flag_neg.iterrows():
    match = trans[
        (trans["amount"] > 0) &
        (trans["product_id"] == neg_row["product_id"]) &
        (abs(trans["amount"] + neg_row["amount"]) < tolerance) &
        (trans["transaction_date"] < neg_row["transaction_date"])
    ]
    refund_flags.append(not match.empty)

from collections import Counter
refund_counts = Counter(refund_flags)
refund_counts

Counter({False: 43, True: 1})

In [45]:
matched_pairs = []

for idx, neg_row in flag_neg.iterrows():
    match = trans[
        (trans["amount"] > 0) &
        (trans["product_id"] == neg_row["product_id"]) &
        (abs(trans["amount"] + neg_row["amount"]) < tolerance) &
        (trans["transaction_date"] < neg_row["transaction_date"])
    ]
    
    if not match.empty:
        matched_pairs.append(neg_row)
        matched_pairs.append(match.iloc[0])

refund_matches_stacked = pd.DataFrame(matched_pairs).reset_index(drop=True)
refund_matches_stacked

   transaction_id transaction_date  product_id      amount
0             135       2024-07-24         102 -468.879208
1             238       2024-03-28         102  468.882452

Out of all negative transactions, only one had a corresponding positive transaction that could explain it as a refund.

Since I’m confident this one is a valid case, I’ll remove it from the flagged_transactions.csv file to keep only truly suspicious records.

In [47]:
flagged = pd.read_csv("flagged_transactions.csv")
refund_neg_row = refund_matches_stacked.iloc[0]

matching_refund = (flagged["transaction_id"] == refund_neg_row["transaction_id"]) & \
                  (abs(flagged["amount"] - refund_neg_row["amount"]) < 1e-2)

flagged = flagged[matching_refund == False]

flagged.to_csv("flagged_transactions.csv", index=False)

And I'll check if it's removed from the csv.

In [48]:
flagged[flagged["transaction_id"] == refund_neg_row["transaction_id"]]

Empty DataFrame
Columns: [transaction_id, transaction_date, product_id, amount]
Index: []

In [98]:
trans.describe()

       transaction_id               transaction_date   product_id       amount
count     1000.000000                            999  1000.000000  1000.000000
mean       500.500000  2024-06-25 18:22:42.162162176   103.439000   250.316294
min          1.000000            2024-01-01 00:00:00   101.000000  -468.879208
25%        250.750000            2024-03-23 00:00:00   102.000000   158.243350
50%        500.500000            2024-06-20 00:00:00   103.000000   265.737134
75%        750.250000            2024-09-23 00:00:00   105.000000   368.072009
max       1000.000000            2024-12-31 00:00:00   106.000000   498.707406
std        288.819436                            NaN     1.697398   170.610922